/hold cancel

The secret has been created!

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_secret_manager_secret.build_cluster_secrets["eks-prow-build-cluster-kubeconfig"] will be created
  + resource "google_secret_manager_secret" "build_cluster_secrets" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "group" = "sig-k8s-infra"
        }
      + name        = (known after apply)
      + project     = "k8s-infra-prow-build-trusted"
      + secret_id   = "eks-prow-build-cluster-kubeconfig"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_binding.build_cluster_secret_admins["eks-prow-build-cluster-kubeconfig"] will be created
  + resource "google_secret_manager_secret_iam_binding" "build_cluster_secret_admins" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "group:k8s-infra-aws-admins@kubernetes.io",
          + "group:k8s-infra-prow-oncall@kubernetes.io",
        ]
      + project   = "k8s-infra-prow-build-trusted"
      + role      = "roles/secretmanager.admin"
      + secret_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
```